RP-M1/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices        
(
    (-100 4 0)
    (-4 4 0)
    (0 4 0)
    (4 4 0)
    (100 4 0) 
     (100 0 0)
    (5.656854 0 0)
    (1 0 0)
    (0.707107 0.707107 0)
    (0 1 0)
    (-0.707107 0.707107 0)
    (-1 0 0)
    (-5.656854 0 0)
    (-100 0 0)
    (-100 -4 0)
    (-4 -4 0)
    (-0.707107 -0.707107 0)
    (0 -1 0)
    (0.707107 -0.707107 0)
    (0 -4 0)
    (4 -4 0)
    (100 -4 0)
    (-100 4 0.01)
    (-4 4 0.01)
    (0 4 0.01)
    (4 4 0.01)
    (100 4 0.01) 
     (100 0 0.01)
    (5.656854 0 0.01)
    (1 0 0.01)
    (0.707107 0.707107 0.01)
    (0 1 0.01)
    (-0.707107 0.707107 0.01)
    (-1 0 0.01)
    (-5.656854 0 0.01)
    (-100 0 0.01)
    (-100 -4 0.01)
    (-4 -4 0.01)
    (-0.707107 -0.707107 0.01)
    (0 -1 0.01)
    (0.707107 -0.707107 0.01)
    (0 -4 0.01)
    (4 -4 0.01)
    (100 -4 0.01)
);

blocks          
(
    hex (13 12 1 0 35 34 23 22) (40 25 1)simpleGrading (0.05 1 1)
    hex (12 11 10 1 34 33 32 23) (45 25 1) simpleGrading (0.025 1 1)
    hex (10 9 2 1 32 31 24 23) (25 45 1) simpleGrading (1 40 1)
    hex (9 8 3 2 31 30 25 24) (25 45 1) simpleGrading (1 40 1)
    hex (7 6 3 8 29 28 25 30) (45 25 1) simpleGrading (40 1 1)
    hex (6 5 4 3 28 27 26 25) (40 25 1) simpleGrading (20 1 1)
    hex (20 21 5 6 42 43 27 28) (40 25 1)simpleGrading (20 1 1)
    hex (18 20 6 7 40 42 28 29) (45 25 1) simpleGrading (40 1 1)
    hex (18 17 19 20 40 39 41 42) (25 45 1) simpleGrading (1 40 1)
    hex (17 16 15 19 39 38 37 41) (25 45 1) simpleGrading (1 40 1)
    hex (15 16 11 12 37 38 33 34) (45 25 1) simpleGrading (0.025 1 1)
    hex (14 15 12 13 36 37 34 35) (40 25 1) simpleGrading (0.05 1 1)
);

edges           
(
    arc 7 8 (0.939693 0.34202 0)
    arc 8 9 (0.34202 0.939693 0)
    arc 10 9 (-0.34202 0.939693 0)
    arc 11 10 (-0.939693 0.34202 0)
    arc 11 16 (-0.939693 -0.34202 0)
    arc 16 17 (-0.34202 -0.939693 0)
    arc 18 17 (0.34202 -0.939693 0)
    arc 7 18 (0.939693 -0.34202 0)
    arc 6 3 (5.315706 1.93478 0)
    arc 12 1 (-5.315706 1.93478 0)
    arc 12 15 (-5.315706 -1.93478 0)
    arc 6 20 (5.315706 -1.93478 0)
    arc 29 30 (0.939693 0.34202 0.01)
    arc 30 31 (0.34202 0.939693 0.01)
    arc 32 31 (-0.34202 0.939693 0.01)
    arc 33 32 (-0.939693 0.34202 0.01)
    arc 33 38 (-0.939693 -0.34202 0.01)
    arc 38 39 (-0.34202 -0.939693 0.01)
    arc 40 39 (0.34202 -0.939693 0.01)
    arc 29 40 (0.939693 -0.34202 0.01)
    arc 28 25 (5.315706 1.93478 0.01)
    arc 34 23 (-5.315706 1.93478 0.01)
    arc 34 37 (-5.315706 -1.93478 0.01)
    arc 28 42 (5.315706 -1.93478 0.01)
);
patches         
(
    patch left 
    (
        (22 0 13 35)
        (35 13 14 36)
    )
    wall down 
    (
        (14 15 37 36)
        (15 19 41 37)
        (19 20 42 41)
        (20 21 43 42)
    )
    patch right 
    (
        (27 5 4 26)
        (43 21 5 27)
    )
    wall up 
    (
        (1 0 22 23)
        (2 1 23 24)
        (3 2 24 25)
        (4 3 25 26)
    )
    wall cylinder 
    (
        (11 10 32 33)
        (10 9 31 32)
        (9 8 30 31)
        (8 7 29 30)
        (7 18 40 29)
        (18 17 39 40)
        (17 16 38 39)
        (16 11 33 38)
    )
    empty frontAndBack
    (
/*        (0 13 12 1)
        (1 12 3 2)
        (3 12 11 4)
        (4 11 10 5)
	 (6 5 10 7)
	 (7 10 9 8)
        (14 15 26 27)
        (15 16 17 26)
        (17 18 25 26)
        (18 19 24 25)
	 (20 19 24 21)
	 (21 22 23 24)
*/    )

);

mergePatchPairs
(
);

// ************************************************************************* //
