RP-M1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0-xly                             |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    left
    {
        type            patch;
        nFaces          50;
        startFace       25720;
    }
    down
    {
        type            wall;
        nFaces          130;
        startFace       25770;
    }
    right
    {
        type            patch;
        nFaces          50;
        startFace       25900;
    }
    up
    {
        type            wall;
        nFaces          130;
        startFace       25950;
    }
    cylinder
    {
        type            wall;
        nFaces          200;
        startFace       26080;
    }
    frontAndBack
    {
        type            empty;
        nFaces          0;
        startFace       26280;
    }
    defaultFaces
    {
        type            empty;
        nFaces          26000;
        startFace       26280;
    }
)

// ************************************************************************* //
