RP-M1/system/.svn/dir-prop-base
K 10
svn:ignore
V 16
lnInclude
*.dep

END
