RP-M1/system/.svn/dir-props
K 10
svn:ignore
V 16
lnInclude
*.dep

END
