RP-M1/system/decomposeParDict
// Mesh decomposition control dictionary

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

FoamFile
{
    version 0.5;
    format ascii;

    root     "ROOT";
    case     "CASE";
    instance "system";
    local    "";

    class dictionary;

    object decompositionDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  12;

//method               simple;
//method               hierarchical;
method               scotch;
//method               manual;

simpleCoeffs
{
    n                    (4 1 1);
    delta                0.001;
}

hierarchicalCoeffs
{
    n                    (12 1 1);
    delta                0.001;
    order                xyz;
}

manualCoeffs
{
    dataFile             "decompositionData";
}

// ************************************************************************* //
