RP-M1/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat     raw;

writeFormat raw;

sets
( 
    //face
    //leftPatc 
    centre
    {
        type            cloud; //uniform;
        axis            x; 
       // start           (0.00 0.000 0.000);
       // end             (0.18 0.000 0.000);
       // nPoints         100;
         points
(
(	0	0	0	)
(	0.001460469	0	0	)
(	0.002894407	0	0	)
(	0.004302296	0	0	)
(	0.005684609	0	0	)
(	0.00704181	0	0	)
(	0.008374357	0	0	)
(	0.009682695	0	0	)
(	0.010967266	0	0	)
(	0.012228502	0	0	)
(	0.013466825	0	0	)
(	0.014682653	0	0	)
(	0.015876393	0	0	)
(	0.017048448	0	0	)
(	0.018199211	0	0	)
(	0.019329069	0	0	)
(	0.020438402	0	0	)
(	0.021527582	0	0	)
(	0.022596977	0	0	)
(	0.023646944	0	0	)
(	0.024677837	0	0	)
(	0.025690003	0	0	)
(	0.026683781	0	0	)
(	0.027659506	0	0	)
(	0.028617506	0	0	)
(	0.029558103	0	0	)
(	0.030481612	0	0	)
(	0.031388345	0	0	)
(	0.032278606	0	0	)
(	0.033152695	0	0	)
(	0.034010904	0	0	)
(	0.034853523	0	0	)
(	0.035680835	0	0	)
(	0.036493117	0	0	)
(	0.037290644	0	0	)
(	0.038073682	0	0	)
(	0.038842495	0	0	)
(	0.039597342	0	0	)
(	0.040338477	0	0	)
(	0.041066147	0	0	)
(	0.041780599	0	0	)
(	0.042482072	0	0	)
(	0.043170801	0	0	)
(	0.043847019	0	0	)
(	0.044510953	0	0	)
(	0.045162825	0	0	)
(	0.045802856	0	0	)
(	0.046431259	0	0	)
(	0.047048247	0	0	)
(	0.047654026	0	0	)
(	0.048248801	0	0	)
(	0.048832771	0	0	)
(	0.049406132	0	0	)
(	0.049969077	0	0	)
(	0.050521796	0	0	)
(	0.051064474	0	0	)
(	0.051597294	0	0	)
(	0.052120434	0	0	)
(	0.052634071	0	0	)
(	0.053138376	0	0	)
(	0.053633521	0	0	)
(	0.054119671	0	0	)
(	0.054596989	0	0	)
(	0.055065636	0	0	)
(	0.055525769	0	0	)
(	0.055977544	0	0	)
(	0.056421111	0	0	)
(	0.056856621	0	0	)
(	0.057284219	0	0	)
(	0.057704049	0	0	)
(	0.058116253	0	0	)
(	0.058520968	0	0	)
(	0.058918331	0	0	)
(	0.059308475	0	0	)
(	0.059691532	0	0	)
(	0.060067631	0	0	)
(	0.060436897	0	0	)
(	0.060799455	0	0	)
(	0.061155426	0	0	)
(	0.061504931	0	0	)
(	0.061848087	0	0	)
(	0.062185008	0	0	)
(	0.06251581	0	0	)
(	0.062840601	0	0	)
(	0.063159493	0	0	)
(	0.063472591	0	0	)
(	0.063780002	0	0	)
(	0.064081828	0	0	)
(	0.064378171	0	0	)
(	0.064669131	0	0	)
(	0.064954805	0	0	)
(	0.065235289	0	0	)
(	0.065510678	0	0	)
(	0.065781065	0	0	)
(	0.066046539	0	0	)
(	0.066307191	0	0	)
(	0.066563107	0	0	)
(	0.066814375	0	0	)
(	0.067061078	0	0	)
...
(	0.18	0	0	)

);   
    }
);

surfaces
();

fields
(
//    U.component(0)
U
//sigmap
sigmap
p
);

// ************************************************************************* //
